### **SOLVING LEETCODE SQL QUESTIONS INTO PANDAS**

### **Importing Necessary Library**

In [1]:
import pandas as pd
import numpy as np
import mysql.connector

#### **Connecting to the mysql**

In [2]:
import mysql.connector
import pandas as pd

def connecting_to_mysql(user, password, host, database_name, table_name):
    
    """
    Connects to a MySQL database and retrieves data from a specified table.

    Parameters:
    - user (str): The username for the MySQL database.
    - password (str): The password for the MySQL database.
    - host (str): The host where the MySQL database is located.
    - database_name (str): The name of the database to connect to.
    - table_name (str): The name of the table to query.

    Returns:
    - pd.DataFrame: DataFrame containing the data from the specified table.
    """
    
    try:
        # Database configuration
        config = {
            'user': user,
            'password': password,
            'host': host,
            'database': database_name
        }

        # Establish connection to the database
        conn = mysql.connector.connect(**config)

        # Define the SQL query
        query = f'SELECT * FROM {table_name}'

        # Execute the query and read the data into a DataFrame
        df = pd.read_sql(query, conn)
        
    except mysql.connector.Error as err:
        print(f"Error: {err}")
        df = pd.DataFrame()  # Return an empty DataFrame in case of error

    finally:
        # Close the database connection
        if conn.is_connected():
            conn.close()

    return df

#### **Q1.) Write the Pandas query to find the IDs of products that are both low fat and recyclable**

In [3]:
# Creating the data frame product
df_product = connecting_to_mysql('root','Sushant@123','localhost','leetcode','products')
df_product

C:\Users\DELL\AppData\Local\Temp\ipykernel_6208\2953352820.py:36: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

   product_id low_fats recyclable
0           0        Y          N
1           1        Y          Y
2           2        N          Y
3           3        Y          Y
4           4        N          N

In [4]:
df_product

   product_id low_fats recyclable
0           0        Y          N
1           1        Y          Y
2           2        N          Y
3           3        Y          Y
4           4        N          N

In [5]:
result = df_product[(df_product['low_fats'] == 'Y') & (df_product['recyclable'] == 'Y')]
result

   product_id low_fats recyclable
1           1        Y          Y
3           3        Y          Y

In [6]:
result = result[['product_id']].reset_index(drop=True)
result

   product_id
0           1
1           3

#### **Q2.) Find the names of the customer that are not referred by the customer with id = 2.**

In [7]:
# Creating the data frame customer
df_customer = connecting_to_mysql('root','Sushant@123','localhost','leetcode','customer')
df_customer

C:\Users\DELL\AppData\Local\Temp\ipykernel_6208\2953352820.py:36: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

   id  name  referee_id
0   1  Will         NaN
1   2  Jane         NaN
2   3  Alex         2.0
3   4  Bill         NaN
4   5  Zack         1.0
5   6  Mark         2.0

In [8]:
result = df_customer[(df_customer['referee_id'] != 2) | (df_customer['referee_id'] == np.nan)]
result

   id  name  referee_id
0   1  Will         NaN
1   2  Jane         NaN
3   4  Bill         NaN
4   5  Zack         1.0

In [9]:
result = result[['name']].reset_index(drop=True)
result

   name
0  Will
1  Jane
2  Bill
3  Zack

#### **Q3.)A country is big if:**
 - it has an area of at least three million (i.e., 3000000 km2), or
 - it has a population of at least twenty-five million (i.e., 25000000).
#### **Write a solution to find the name, population, and area of the big countries.**

In [10]:
df_world = connecting_to_mysql('root','Sushant@123','localhost','leetcode','world')
df_world

C:\Users\DELL\AppData\Local\Temp\ipykernel_6208\2953352820.py:36: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
1      Albania    Europe    28748     2831741   12960000000
2      Algeria    Africa  2381741    37100000  188681000000
3      Andorra    Europe      468       78115    3712000000
4       Angola    Africa  1246700    20609294  100990000000

In [11]:
result = df_world[(df_world['area'] >= 3000000) | (df_world['population'] >= 25000000)]
result

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
2      Algeria    Africa  2381741    37100000  188681000000

In [12]:
result = result[['name','population','area']].reset_index(drop=True)
result

          name  population     area
0  Afghanistan    25500100   652230
1      Algeria    37100000  2381741

#### **Q4.) To find all authors who have viewed at least one of their own articles, you can use the following SQL query.**

In [13]:
df_view = connecting_to_mysql('root','Sushant@123','localhost','leetcode','views')
df_view

C:\Users\DELL\AppData\Local\Temp\ipykernel_6208\2953352820.py:36: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

   article_id  author_id  viewer_id   view_date
0           1          3          5  2019-08-01
1           1          3          6  2019-08-02
2           2          7          7  2019-08-01
3           2          7          6  2019-08-02
4           4          7          1  2019-07-22
5           3          4          4  2019-07-21
6           3          4          4  2019-07-21

In [14]:
df_view.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   article_id  7 non-null      int64
 1   author_id   7 non-null      int64
 2   viewer_id   7 non-null      int64
 3   view_date   7 non-null      object
dtypes: int64(3), object(1)
memory usage: 356.0+ bytes

In [15]:
result  = df_view[(df_view['author_id'] == df_view['viewer_id'])].sort_values(by=['author_id'],ascending=True)
result

   article_id  author_id  viewer_id   view_date
5           3          4          4  2019-07-21
6           3          4          4  2019-07-21
2           2          7          7  2019-08-01

In [16]:
result_1 = result['author_id'].unique()
result_1

array([4, 7])

In [17]:
result_1 = pd.DataFrame(result_1,columns = ['id'])
result_1

   id
0   4
1   7

#### **Q5.) Write a solution to find the IDs of the invalid tweets. The tweet is invalid ,if the number of characters used in the content of the tweet is strictly greater than 15.**

In [18]:
df_tweet = connecting_to_mysql('root','Sushant@123','localhost','leetcode','tweets')
df_tweet

C:\Users\DELL\AppData\Local\Temp\ipykernel_6208\2953352820.py:36: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

   tweet_id                           content
0         1                    Vote for Biden
1         2  Let us make America great again!

In [19]:
(df_tweet['content'])

0                      Vote for Biden
1    Let us make America great again!
Name: content, dtype: object

In [20]:
result = df_tweet[(df_tweet['content'].apply(lambda x:len(x)>15))]
result

   tweet_id                           content
1         2  Let us make America great again!

In [21]:
result = result[['tweet_id']].reset_index(drop=True)
result

   tweet_id
0         2

#### **Q6.) Write a solution to show the unique ID of each user, If a user does not have a unique ID replace just show null.**

In [22]:
df_employee = connecting_to_mysql('root','Sushant@123','localhost','leetcode','employees')
df_employeeuni = connecting_to_mysql('root','Sushant@123','localhost','leetcode','employeeuni')

C:\Users\DELL\AppData\Local\Temp\ipykernel_6208\2953352820.py:36: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

In [23]:
df_employee

   id      name
0   1     Alice
1   3  Jonathan
2   7       Bob
3  11      Meir
4  90   Winston

In [24]:
df_employeeuni

   id  unique_id
0   3          1
1  11          2
2  90          3

In [25]:
result = pd.merge(left=df_employee,right=df_employeeuni,how='left',on='id').sort_values(by=['unique_id'],ascending=True)
result

   id      name  unique_id
1   3  Jonathan        1.0
3  11      Meir        2.0
4  90   Winston        3.0
0   1     Alice        NaN
2   7       Bob        NaN

In [26]:
result = result[['name','unique_id']].reset_index(drop=True)
result

       name  unique_id
0  Jonathan        1.0
1      Meir        2.0
2   Winston        3.0
3     Alice        NaN
4       Bob        NaN

#### **Q7.) Write a solution to report the product_name, year, and price for each sale_id in the Sales table.**

In [27]:
df_products = connecting_to_mysql('root','Sushant@123','localhost','leetcode','product')
df_sales = connecting_to_mysql('root','Sushant@123','localhost','leetcode','sales')

C:\Users\DELL\AppData\Local\Temp\ipykernel_6208\2953352820.py:36: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

In [28]:
df_products

   product_id product_name
0         100        Nokia
1         200        Apple
2         300      Samsung

In [29]:
df_sales

   sale_id  product_id  year  quantity  price
0        1         100  2008        10   5000
1        2         100  2009        12   5000
2        7         200  2011        15   9000

In [30]:
result = pd.merge(left=df_products,right=df_sales,how='inner',on='product_id')
result

   product_id product_name  sale_id  year  quantity  price
0         100        Nokia        1  2008        10   5000
1         100        Nokia        2  2009        12   5000
2         200        Apple        7  2011        15   9000

In [31]:
result = result[['product_name','year','price']].reset_index(drop=True)
result

  product_name  year  price
0        Nokia  2008   5000
1        Nokia  2009   5000
2        Apple  2011   9000

#### **Q8.) Write a solution to find the IDs of the users who visited without making any transactions and the number of times they made these types of visits**

In [32]:
df_visits = connecting_to_mysql('root','Sushant@123','localhost','leetcode','visits')
df_transactions = connecting_to_mysql('root','Sushant@123','localhost','leetcode','transactions')

C:\Users\DELL\AppData\Local\Temp\ipykernel_6208\2953352820.py:36: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

In [33]:
df_visits

   visit_id  customer_id
0         1           23
1         2            9
2         4           30
3         5           54
4         6           96
5         7           54
6         8           54

In [34]:
df_transactions

   transaction_id  visit_id  amount
0               2         5     310
1               3         5     300
2               9         5     200
3              12         1     910
4              13         2     970

In [35]:
df = pd.merge(left=df_visits,right=df_transactions,how='left',on='visit_id')
df

   visit_id  customer_id  transaction_id  amount
0         1           23            12.0   910.0
1         2            9            13.0   970.0
2         4           30             NaN     NaN
3         5           54             2.0   310.0
4         5           54             3.0   300.0
5         5           54             9.0   200.0
6         6           96             NaN     NaN
7         7           54             NaN     NaN
8         8           54             NaN     NaN

In [36]:
filter_tran_nan = df[df['transaction_id'].isna()]
filter_tran_nan

   visit_id  customer_id  transaction_id  amount
2         4           30             NaN     NaN
6         6           96             NaN     NaN
7         7           54             NaN     NaN
8         8           54             NaN     NaN

In [37]:
result = filter_tran_nan.groupby('customer_id',as_index=False).agg(count_no_tran = ('customer_id','count'))
result

   customer_id  count_no_tran
0           30              1
1           54              2
2           96              1

#### **Q9.) Write a solution to find all dates' Id with higher temperatures compared to its previous dates**

In [42]:
df_weather =  connecting_to_mysql('root','Sushant@123','localhost','leetcode','weather')
df_weather

C:\Users\DELL\AppData\Local\Temp\ipykernel_6208\2953352820.py:36: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

   id  recordDate  temperature
0   1  2015-01-01           10
1   2  2015-01-02           25
2   3  2015-01-03           20
3   4  2015-01-04           30

In [43]:
df_weather.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           4 non-null      int64
 1   recordDate   4 non-null      object
 2   temperature  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [40]:
# df_weather = pd.to_datetime(df_weather['recordDate'])
# df_weather.info()

<class 'pandas.core.series.Series'>
RangeIndex: 4 entries, 0 to 3
Series name: recordDate
Non-Null Count  Dtype
--------------  -----
4 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 164.0 bytes

In [52]:
df_self_join = pd.merge(df_weather,df_weather,how='inner',left_on='recordDate',right_on='recordDate',suffixes=('_a','_b'))
df_self_join

   id_a  recordDate  temperature_a  id_b  temperature_b
0     1  2015-01-01             10     1             10
1     2  2015-01-02             25     2             25
2     3  2015-01-03             20     3             20
3     4  2015-01-04             30     4             30

In [60]:
merged_weather = pd.merge(df_weather, df_weather,left_on=df_weather['recordDate']-pd.Timedelta(days=1), right_on='recordDate', suffixes=('_a', '_b'))

In [64]:
merged_weather

,recordDate,id_a,recordDate_a,temperature_a,id_b,recordDate_b,temperature_b
0,2015-01-01,2,2015-01-02,25,1,2015-01-01,10
1,2015-01-02,3,2015-01-03,20,2,2015-01-02,25
2,2015-01-03,4,2015-01-04,30,3,2015-01-03,20

In [69]:
result = merged_weather[merged_weather['temperature_a'] > merged_weather['temperature_b']]

In [70]:
result['id_a']

0    2
2    4
Name: id_a, dtype: int64

### **Q10.)Write a solution to find the average time each machine takes to complete a process.

 - The time to complete a process is the 'end' timestamp minus the 'start' timestamp. The average time is calculated by the total time 
 - to complete every process on the machine divided by the number of processes that were run.
 - The resulting table should have the machine_id along with the average time as processing_time, which should be rounded to 3 decimal places.

In [73]:
activity = connecting_to_mysql('root','Sushant@123','localhost','leetcode','activity')
activity

C:\Users\DELL\AppData\Local\Temp\ipykernel_6208\2953352820.py:36: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

    machine_id  process_id activity_type  timestamp
0            0           0         start      0.712
1            0           0           end      1.520
2            0           1         start      3.140
3            0           1           end      4.120
4            1           0         start      0.550
5            1           0           end      1.550
6            1           1         start      0.430
7            1           1           end      1.420
8            2           0         start      4.100
9            2           0           end      4.512
10           2           1         start      2.500
11           2           1           end      5.000

In [74]:
activity.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   machine_id     12 non-null     int64
 1   process_id     12 non-null     int64
 2   activity_type  12 non-null     object
 3   timestamp      12 non-null     float64
dtypes: float64(1), int64(2), object(1)
memory usage: 516.0+ bytes

In [81]:
time_diff = activity.pivot_table(index=['machine_id','process_id'],columns='activity_type',values='timestamp')
time_diff

activity_type            end  start
machine_id process_id
0          0           1.520  0.712
           1           4.120  3.140
1          0           1.550  0.550
           1           1.420  0.430
2          0           4.512  4.100
           1           5.000  2.500

In [82]:
time_diff['time_difference'] = time_diff['end'] - time_diff['start']
time_diff

activity_type            end  start  time_difference
machine_id process_id
0          0           1.520  0.712            0.808
           1           4.120  3.140            0.980
1          0           1.550  0.550            1.000
           1           1.420  0.430            0.990
2          0           4.512  4.100            0.412
           1           5.000  2.500            2.500

In [90]:
result = time_diff.groupby('machine_id').agg(processing_time=('time_difference','mean')).reset_index()
result

   machine_id  processing_time
0           0            0.894
1           1            0.995
2           2            1.456